Workload_d_rg_values_RUN.txt
[OVERALL], Throughput(ops/sec), 14469.68600781363
[OVERALL], Throughput(ops/sec), 20755.500207555004
[OVERALL], Throughput(ops/sec), 23119.60542540074
[OVERALL], Throughput(ops/sec), 23827.96211354024
[OVERALL], Throughput(ops/sec), 24871.909665224095
[OVERALL], Throughput(ops/sec), 14469.68600781363
[OVERALL], Throughput(ops/sec), 20755.500207555004
[OVERALL], Throughput(ops/sec), 23119.60542540074
[OVERALL], Throughput(ops/sec), 23827.96211354024
[OVERALL], Throughput(ops/sec), 24871.909665224095
[OVERALL], Throughput(ops/sec), 12456.402590931739
[OVERALL], Throughput(ops/sec), 18903.59168241966
[OVERALL], Throughput(ops/sec), 20299.073008999254
[OVERALL], Throughput(ops/sec), 19692.792437967702
[OVERALL], Throughput(ops/sec), 25826.446280991735
[OVERALL], Throughput(ops/sec), 14505.36698578474
[OVERALL], Throughput(ops/sec), 13889.853462045976
[OVERALL], Throughput(ops/sec), 16468.134160399626
[OVERALL], Throughput(ops/sec), 26051.843167904128
[OVERALL], Throughput(ops/sec), 18337.184142003152
[OVERALL], Throughput(ops/sec), 9268.699601445916
[OVERALL], Throughput(ops/sec), 22187.70800976259
[OVERALL], Throughput(ops/sec), 15893.19771137953
[OVERALL], Throughput(ops/sec), 18323.40815391663
[OVERALL], Throughput(ops/sec), 28278.94349867089
[OVERALL], Throughput(ops/sec), 1305.5341593012781
[OVERALL], Throughput(ops/sec), 1746.7248908296942
[OVERALL], Throughput(ops/sec), 1687.383992350526
[OVERALL], Throughput(ops/sec), 1484.7809948032666
[OVERALL], Throughput(ops/sec), 1559.6536321213785
[OVERALL], Throughput(ops/sec), 7019.514249613927
[OVERALL], Throughput(ops/sec), 9510.675733510867
[OVERALL], Throughput(ops/sec), 8770.391159445711
[OVERALL], Throughput(ops/sec), 9003.331232556046
[OVERALL], Throughput(ops/sec), 8605.1114361931
[OVERALL], Throughput(ops/sec), 12456.402590931739
[OVERALL], Throughput(ops/sec), 18903.59168241966
[OVERALL], Throughput(ops/sec), 20299.073008999254
[OVERALL], Throughput(ops/sec), 19692.792437967702
[OVERALL], Throughput(ops/sec), 25826.446280991735
[OVERALL], Throughput(ops/sec), 12456.402590931739
[OVERALL], Throughput(ops/sec), 18903.59168241966
[OVERALL], Throughput(ops/sec), 20299.073008999254
[OVERALL], Throughput(ops/sec), 19692.792437967702
[OVERALL], Throughput(ops/sec), 25826.446280991735
[OVERALL], Throughput(ops/sec), 14505.36698578474
[OVERALL], Throughput(ops/sec), 13889.853462045976
[OVERALL], Throughput(ops/sec), 16468.134160399626
[OVERALL], Throughput(ops/sec), 26051.843167904128
[OVERALL], Throughput(ops/sec), 18337.184142003152
[OVERALL], Throughput(ops/sec), 14505.36698578474
[OVERALL], Throughput(ops/sec), 13889.853462045976
[OVERALL], Throughput(ops/sec), 16468.134160399626
[OVERALL], Throughput(ops/sec), 26051.843167904128
[OVERALL], Throughput(ops/sec), 18337.184142003152
[OVERALL], Throughput(ops/sec), 9268.699601445916
[OVERALL], Throughput(ops/sec), 22187.70800976259
[OVERALL], Throughput(ops/sec), 15893.19771137953
[OVERALL], Throughput(ops/sec), 18323.40815391663
[OVERALL], Throughput(ops/sec), 28278.94349867089
[OVERALL], Throughput(ops/sec), 1305.5341593012781
[OVERALL], Throughput(ops/sec), 1746.7248908296942
[OVERALL], Throughput(ops/sec), 1687.383992350526
[OVERALL], Throughput(ops/sec), 1484.7809948032666
[OVERALL], Throughput(ops/sec), 1559.6536321213785
[OVERALL], Throughput(ops/sec), 7019.514249613927
[OVERALL], Throughput(ops/sec), 9510.675733510867
[OVERALL], Throughput(ops/sec), 8770.391159445711
[OVERALL], Throughput(ops/sec), 9003.331232556046
[OVERALL], Throughput(ops/sec), 8605.1114361931
[READ], AverageLatency(us), 682.9780396677133
[CLEANUP], AverageLatency(us), 138435.25
[UPDATE], AverageLatency(us), 637.2866430497967
[READ], AverageLatency(us), 565.1003069294062
[CLEANUP], AverageLatency(us), 138306.875
[UPDATE], AverageLatency(us), 514.6933494703782
[READ], AverageLatency(us), 583.3300612272062
[CLEANUP], AverageLatency(us), 138436.6875
[UPDATE], AverageLatency(us), 495.11750367303324
[READ], AverageLatency(us), 603.8140063053775
[CLEANUP], AverageLatency(us), 138690.625
[UPDATE], AverageLatency(us), 506.3194273638559
[READ], AverageLatency(us), 600.4127598491785
[CLEANUP], AverageLatency(us), 138692.6875
[UPDATE], AverageLatency(us), 501.0536288079775
[READ], AverageLatency(us), 682.9780396677133
[CLEANUP], AverageLatency(us), 138435.25
[UPDATE], AverageLatency(us), 637.2866430497967
[READ], AverageLatency(us), 565.1003069294062
[CLEANUP], AverageLatency(us), 138306.875
[UPDATE], AverageLatency(us), 514.6933494703782
[READ], AverageLatency(us), 583.3300612272062
[CLEANUP], AverageLatency(us), 138436.6875
[UPDATE], AverageLatency(us), 495.11750367303324
[READ], AverageLatency(us), 603.8140063053775
[CLEANUP], AverageLatency(us), 138690.625
[UPDATE], AverageLatency(us), 506.3194273638559
[READ], AverageLatency(us), 600.4127598491785
[CLEANUP], AverageLatency(us), 138692.6875
[UPDATE], AverageLatency(us), 501.0536288079775
[READ], AverageLatency(us), 821.9129342249138
[CLEANUP], AverageLatency(us), 138819.3125
[UPDATE], AverageLatency(us), 950.1685761047463
[READ], AverageLatency(us), 616.5120901553096
[CLEANUP], AverageLatency(us), 138563.625
[UPDATE], AverageLatency(us), 666.5956889605158
[READ], AverageLatency(us), 633.5749429564363
[CLEANUP], AverageLatency(us), 138562.875
[UPDATE], AverageLatency(us), 665.7270323859881
[READ], AverageLatency(us), 694.4795490015975
[CLEANUP], AverageLatency(us), 138948.5625
[UPDATE], AverageLatency(us), 717.8576061467844
[READ], AverageLatency(us), 525.8461690737629
[CLEANUP], AverageLatency(us), 138436.1875
[UPDATE], AverageLatency(us), 553.5512840900055
[READ], AverageLatency(us), 646.53405
[CLEANUP], AverageLatency(us), 138563.6875
[READ], AverageLatency(us), 882.164635
[CLEANUP], AverageLatency(us), 138949.0
[READ], AverageLatency(us), 791.40157
[CLEANUP], AverageLatency(us), 139332.125
[READ], AverageLatency(us), 497.25088
[CLEANUP], AverageLatency(us), 138690.9375
[READ], AverageLatency(us), 763.640112
[CLEANUP], AverageLatency(us), 139460.6875
[READ], AverageLatency(us), 1186.6350864249578
[CLEANUP], AverageLatency(us), 138947.8125
[INSERT], AverageLatency(us), 1404.61015625
[READ], AverageLatency(us), 490.87901986782845
[CLEANUP], AverageLatency(us), 138435.0625
[INSERT], AverageLatency(us), 602.5134754625905
[READ], AverageLatency(us), 820.6484949738867
[CLEANUP], AverageLatency(us), 138820.1875
[INSERT], AverageLatency(us), 960.6918743372216
[READ], AverageLatency(us), 728.5493609113594
[CLEANUP], AverageLatency(us), 138692.0625
[INSERT], AverageLatency(us), 827.2591615216093
[READ], AverageLatency(us), 469.1760060149236
[CLEANUP], AverageLatency(us), 138563.1875
[INSERT], AverageLatency(us), 555.6249156109766
[CLEANUP], AverageLatency(us), 138692.875
[INSERT], AverageLatency(us), 5735.7497491471
[SCAN], AverageLatency(us), 12078.78320721555
[CLEANUP], AverageLatency(us), 140358.1875
[INSERT], AverageLatency(us), 5442.8038565833085
[SCAN], AverageLatency(us), 9093.345774377378
[CLEANUP], AverageLatency(us), 140484.25
[INSERT], AverageLatency(us), 5511.631759883644
[SCAN], AverageLatency(us), 9513.142245343555
[CLEANUP], AverageLatency(us), 140356.9375
[INSERT], AverageLatency(us), 5476.200358137684
[SCAN], AverageLatency(us), 10904.794530608377
[CLEANUP], AverageLatency(us), 142660.1875
[INSERT], AverageLatency(us), 5544.4273705179285
[SCAN], AverageLatency(us), 10389.310111602443
[READ], AverageLatency(us), 1209.33743
[READ-MODIFY-WRITE], AverageLatency(us), 2380.5515985189313
[CLEANUP], AverageLatency(us), 138567.75
[UPDATE], AverageLatency(us), 1164.5681211928177
[READ], AverageLatency(us), 975.58736
[READ-MODIFY-WRITE], AverageLatency(us), 1905.103676212448
[CLEANUP], AverageLatency(us), 138435.5
[UPDATE], AverageLatency(us), 932.5438086162796
[READ], AverageLatency(us), 1138.74156
[READ-MODIFY-WRITE], AverageLatency(us), 2189.832238201229
[CLEANUP], AverageLatency(us), 138820.6875
[UPDATE], AverageLatency(us), 1044.1982700022659
[READ], AverageLatency(us), 1120.7118025
[READ-MODIFY-WRITE], AverageLatency(us), 2143.546328797903
[CLEANUP], AverageLatency(us), 138695.4375
[UPDATE], AverageLatency(us), 1014.064321557858
[READ], AverageLatency(us), 1198.015328
[READ-MODIFY-WRITE], AverageLatency(us), 2285.7621773068636
[CLEANUP], AverageLatency(us), 139204.6875
[UPDATE], AverageLatency(us), 1085.5903261004241
[READ], AverageLatency(us), 821.9129342249138
[CLEANUP], AverageLatency(us), 138819.3125
[UPDATE], AverageLatency(us), 950.1685761047463
[READ], AverageLatency(us), 616.5120901553096
[CLEANUP], AverageLatency(us), 138563.625
[UPDATE], AverageLatency(us), 666.5956889605158
[READ], AverageLatency(us), 633.5749429564363
[CLEANUP], AverageLatency(us), 138562.875
[UPDATE], AverageLatency(us), 665.7270323859881
[READ], AverageLatency(us), 694.4795490015975
[CLEANUP], AverageLatency(us), 138948.5625
[UPDATE], AverageLatency(us), 717.8576061467844
[READ], AverageLatency(us), 525.8461690737629
[CLEANUP], AverageLatency(us), 138436.1875
[UPDATE], AverageLatency(us), 553.5512840900055
[READ], AverageLatency(us), 821.9129342249138
[CLEANUP], AverageLatency(us), 138819.3125
[UPDATE], AverageLatency(us), 950.1685761047463
[READ], AverageLatency(us), 616.5120901553096
[CLEANUP], AverageLatency(us), 138563.625
[UPDATE], AverageLatency(us), 666.5956889605158
[READ], AverageLatency(us), 633.5749429564363
[CLEANUP], AverageLatency(us), 138562.875
[UPDATE], AverageLatency(us), 665.7270323859881
[READ], AverageLatency(us), 694.4795490015975
[CLEANUP], AverageLatency(us), 138948.5625
[UPDATE], AverageLatency(us), 717.8576061467844
[READ], AverageLatency(us), 525.8461690737629
[CLEANUP], AverageLatency(us), 138436.1875
[UPDATE], AverageLatency(us), 553.5512840900055
[READ], AverageLatency(us), 646.53405
[CLEANUP], AverageLatency(us), 138563.6875
[READ], AverageLatency(us), 882.164635
[CLEANUP], AverageLatency(us), 138949.0
[READ], AverageLatency(us), 791.40157
[CLEANUP], AverageLatency(us), 139332.125
[READ], AverageLatency(us), 497.25088
[CLEANUP], AverageLatency(us), 138690.9375
[READ], AverageLatency(us), 763.640112
[CLEANUP], AverageLatency(us), 139460.6875
[READ], AverageLatency(us), 646.53405
[CLEANUP], AverageLatency(us), 138563.6875
[READ], AverageLatency(us), 882.164635
[CLEANUP], AverageLatency(us), 138949.0
[READ], AverageLatency(us), 791.40157
[CLEANUP], AverageLatency(us), 139332.125
[READ], AverageLatency(us), 497.25088
[CLEANUP], AverageLatency(us), 138690.9375
[READ], AverageLatency(us), 763.640112
[CLEANUP], AverageLatency(us), 139460.6875
[READ], AverageLatency(us), 1186.6350864249578
[CLEANUP], AverageLatency(us), 138947.8125
[INSERT], AverageLatency(us), 1404.61015625
[READ], AverageLatency(us), 490.87901986782845
[CLEANUP], AverageLatency(us), 138435.0625
[INSERT], AverageLatency(us), 602.5134754625905
[READ], AverageLatency(us), 820.6484949738867
[CLEANUP], AverageLatency(us), 138820.1875
[INSERT], AverageLatency(us), 960.6918743372216
[READ], AverageLatency(us), 728.5493609113594
[CLEANUP], AverageLatency(us), 138692.0625
[INSERT], AverageLatency(us), 827.2591615216093
[READ], AverageLatency(us), 469.1760060149236
[CLEANUP], AverageLatency(us), 138563.1875
[INSERT], AverageLatency(us), 555.6249156109766
[READ], AverageLatency(us), 682.9780396677133
[CLEANUP], AverageLatency(us), 138435.25
[UPDATE], AverageLatency(us), 637.2866430497967
[READ], AverageLatency(us), 565.1003069294062
[CLEANUP], AverageLatency(us), 138306.875
[UPDATE], AverageLatency(us), 514.6933494703782
[READ], AverageLatency(us), 583.3300612272062
[CLEANUP], AverageLatency(us), 138436.6875
[UPDATE], AverageLatency(us), 495.11750367303324
[READ], AverageLatency(us), 603.8140063053775
[CLEANUP], AverageLatency(us), 138690.625
[UPDATE], AverageLatency(us), 506.3194273638559
[READ], AverageLatency(us), 600.4127598491785
[CLEANUP], AverageLatency(us), 138692.6875
[UPDATE], AverageLatency(us), 501.0536288079775
[READ], AverageLatency(us), 682.9780396677133
[CLEANUP], AverageLatency(us), 138435.25
[UPDATE], AverageLatency(us), 637.2866430497967
[READ], AverageLatency(us), 565.1003069294062
[CLEANUP], AverageLatency(us), 138306.875
[UPDATE], AverageLatency(us), 514.6933494703782
[READ], AverageLatency(us), 583.3300612272062
[CLEANUP], AverageLatency(us), 138436.6875
[UPDATE], AverageLatency(us), 495.11750367303324
[READ], AverageLatency(us), 603.8140063053775
[CLEANUP], AverageLatency(us), 138690.625
[UPDATE], AverageLatency(us), 506.3194273638559
[READ], AverageLatency(us), 600.4127598491785
[CLEANUP], AverageLatency(us), 138692.6875
[UPDATE], AverageLatency(us), 501.0536288079775
[READ], AverageLatency(us), 821.9129342249138
[CLEANUP], AverageLatency(us), 138819.3125
[UPDATE], AverageLatency(us), 950.1685761047463
[READ], AverageLatency(us), 616.5120901553096
[CLEANUP], AverageLatency(us), 138563.625
[UPDATE], AverageLatency(us), 666.5956889605158
[READ], AverageLatency(us), 633.5749429564363
[CLEANUP], AverageLatency(us), 138562.875
[UPDATE], AverageLatency(us), 665.7270323859881
[READ], AverageLatency(us), 694.4795490015975
[CLEANUP], AverageLatency(us), 138948.5625
[UPDATE], AverageLatency(us), 717.8576061467844
[READ], AverageLatency(us), 525.8461690737629
[CLEANUP], AverageLatency(us), 138436.1875
[UPDATE], AverageLatency(us), 553.5512840900055
[READ], AverageLatency(us), 646.53405
[CLEANUP], AverageLatency(us), 138563.6875
[READ], AverageLatency(us), 882.164635
[CLEANUP], AverageLatency(us), 138949.0
[READ], AverageLatency(us), 791.40157
[CLEANUP], AverageLatency(us), 139332.125
[READ], AverageLatency(us), 497.25088
[CLEANUP], AverageLatency(us), 138690.9375
[READ], AverageLatency(us), 763.640112
[CLEANUP], AverageLatency(us), 139460.6875
[READ], AverageLatency(us), 1186.6350864249578
[CLEANUP], AverageLatency(us), 138947.8125
[INSERT], AverageLatency(us), 1404.61015625
[READ], AverageLatency(us), 490.87901986782845
[CLEANUP], AverageLatency(us), 138435.0625
[INSERT], AverageLatency(us), 602.5134754625905
[READ], AverageLatency(us), 820.6484949738867
[CLEANUP], AverageLatency(us), 138820.1875
[INSERT], AverageLatency(us), 960.6918743372216
[READ], AverageLatency(us), 728.5493609113594
[CLEANUP], AverageLatency(us), 138692.0625
[INSERT], AverageLatency(us), 827.2591615216093
[READ], AverageLatency(us), 469.1760060149236
[CLEANUP], AverageLatency(us), 138563.1875
[INSERT], AverageLatency(us), 555.6249156109766
[CLEANUP], AverageLatency(us), 138692.875
[INSERT], AverageLatency(us), 5735.7497491471
[SCAN], AverageLatency(us), 12078.78320721555
[CLEANUP], AverageLatency(us), 140358.1875
[INSERT], AverageLatency(us), 5442.8038565833085
[SCAN], AverageLatency(us), 9093.345774377378
[CLEANUP], AverageLatency(us), 140484.25
[INSERT], AverageLatency(us), 5511.631759883644
[SCAN], AverageLatency(us), 9513.142245343555
[CLEANUP], AverageLatency(us), 140356.9375
[INSERT], AverageLatency(us), 5476.200358137684
[SCAN], AverageLatency(us), 10904.794530608377
[CLEANUP], AverageLatency(us), 142660.1875
[INSERT], AverageLatency(us), 5544.4273705179285
[SCAN], AverageLatency(us), 10389.310111602443
[READ], AverageLatency(us), 1209.33743
[READ-MODIFY-WRITE], AverageLatency(us), 2380.5515985189313
[CLEANUP], AverageLatency(us), 138567.75
[UPDATE], AverageLatency(us), 1164.5681211928177
[READ], AverageLatency(us), 975.58736
[READ-MODIFY-WRITE], AverageLatency(us), 1905.103676[OVERALL], RunTime(ms), 76597
[CLEANUP], AverageLatency(us), 138692.875
[INSERT], AverageLatency(us), 5735.7497491471
[SCAN], AverageLatency(us), 12078.78320721555
[CLEANUP], AverageLatency(us), 140358.1875
[INSERT], AverageLatency(us), 5442.8038565833085
[SCAN], AverageLatency(us), 9093.345774377378
[CLEANUP], AverageLatency(us), 140484.25
[INSERT], AverageLatency(us), 5511.631759883644
[SCAN], AverageLatency(us), 9513.142245343555
[CLEANUP], AverageLatency(us), 140356.9375
[INSERT], AverageLatency(us), 5476.200358137684
[SCAN], AverageLatency(us), 10904.794530608377
[CLEANUP], AverageLatency(us), 142660.1875
[INSERT], AverageLatency(us), 5544.4273705179285
[SCAN], AverageLatency(us), 10389.310111602443
[READ], AverageLatency(us), 1209.33743
[READ-MODIFY-WRITE], AverageLatency(us), 2380.5515985189313
[CLEANUP], AverageLatency(us), 138567.75
[UPDATE], AverageLatency(us), 1164.5681211928177
[READ], AverageLatency(us), 975.58736
[READ-MODIFY-WRITE], AverageLatency(us), 1905.103676212448
[CLEANUP], AverageLatency(us), 138435.5
[UPDATE], AverageLatency(us), 932.5438086162796
[READ], AverageLatency(us), 1138.74156
[READ-MODIFY-WRITE], AverageLatency(us), 2189.832238201229
[CLEANUP], AverageLatency(us), 138820.6875
[UPDATE], AverageLatency(us), 1044.1982700022659
[READ], AverageLatency(us), 1120.7118025
[READ-MODIFY-WRITE], AverageLatency(us), 2143.546328797903
[CLEANUP], AverageLatency(us), 138695.4375
[UPDATE], AverageLatency(us), 1014.064321557858
[READ], AverageLatency(us), 1198.015328
[READ-MODIFY-WRITE], AverageLatency(us), 2285.7621773068636
[CLEANUP], AverageLatency(us), 139204.6875
[UPDATE], AverageLatency(us), 1085.5903261004241